In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.0-cp311-cp311-win_amd64.whl.metadata (19 kB)
Collecting numpy<2,>=1.23.2 (from pandas)
  Downloading numpy-1.26.4-cp311-cp311-win_amd64.whl.metadata (61 kB)
     ---------------------------------------- 0.0/61.0 kB ? eta -:--:--
     ---------------------------------------- 0.0/61.0 kB ? eta -:--:--
     ------ --------------------------------- 10.2/61.0 kB ? eta -:--:--
     ------------------- ------------------ 30.7/61.0 kB 325.1 kB/s eta 0:00:01
     ------------------------------- ------ 51.2/61.0 kB 372.4 kB/s eta 0:00:01
     -------------------------------------- 61.0/61.0 kB 406.4 kB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\cc\.conda\envs\devanshu\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2023.4-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\cc\.conda\envs\devanshu\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.0-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.6 MB 1.3 MB/s eta 0:00:10
   ---------------------------------------- 0.0/11.6 MB 1.3 MB/s eta 0:00:10
   ---------------------------------------- 0.0/11.6 MB 1.3 MB/s eta 0:00:10
   ---------------------------------------- 0.0/11.6 MB 1.3 MB/s eta 0:00:10
   ---------------------------------------- 0.0/11.6 MB 1.3 MB/s eta 0:00:10
   ---------------------------------------- 0.1/11.6 MB 192.5 kB/s eta 0:01:00
   ---------------------------------------- 0.1/11.6 MB 359.9 kB/s eta 0:00:32
    --------------------------------------- 0.2/11.6 MB 540.4 kB/s eta 0:00:22
   - -------------------------------------- 0.3/11.6 MB 756.6 kB/s eta 0:00:15
   - -------------------------------------- 0.4/11.6 MB 791.2 kB/s eta 0:00:15
   - -------------------------------------- 0.4/11.6 MB 844.5 kB/s eta 0:00:14
   - -------------------------------------- 0.4/11.6 MB 844.5 kB/s eta 0:00:14
   - -------------------------------------- 0.4/11.6 MB 844.5 kB/s eta 0:00:14
   - -------------------------------------- 0.4/11.6 MB 844.5 kB/s eta 0:00:14
   - -------------------------------------- 0.4/11.6 MB 844.5 kB/s eta 0:00:14
   - -------------------------------------- 0.5/11.6 MB 599.1 kB/s eta 0:00:19
   - -------------------------------------- 0.5/11.6 MB 601.6 kB/s eta 0:00:19
   - -------------------------------------- 0.5/11.6 MB 579.4 kB/s eta 0:00:20
   - -------------------------------------- 0.5/11.6 MB 582.4 kB/s eta 0:00:20
   - -------------------------------------- 0.5/11.6 MB 576.4 kB/s eta 0:00:20
   -- ------------------------------------- 0.6/11.6 MB 591.8 kB/s eta 0:00:19
   -- ------------------------------------- 0.6/11.6 MB 614.8 kB/s eta 0:00:18
   -- ------------------------------------- 0.7/11.6 MB 635.8 kB/s eta 0:00:18
   -- ------------------------------------- 0.8/11.6 MB 682.7 kB/s eta 0:00:16
   --- ------------------------------------ 0.9/11.6 MB 761.8 kB/s eta 0:00:15
   --- ------------------------------------ 1.1/11.6 MB 885.3 kB/s eta 0:00:12
   ---- ----------------------------------- 1.3/11.6 MB 1.0 MB/s eta 0:00:11
   ----- ---------------------------------- 1.5/11.6 MB 1.1 MB/s eta 0:00:09
   ------ --------------------------------- 1.8/11.6 MB 1.3 MB/s eta 0:00:08
   ------- -------------------------------- 2.1/11.6 MB 1.5 MB/s eta 0:00:07
   -------- ------------------------------- 2.4/11.6 MB 1.7 MB/s eta 0:00:06
   --------- ------------------------------ 2.7/11.6 MB 1.8 MB/s eta 0:00:05
   ---------- ----------------------------- 3.1/11.6 MB 2.0 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.6 MB 2.2 MB/s eta 0:00:04
   ------------- -------------------------- 3.8/11.6 MB 2.3 MB/s eta 0:00:04
   -------------- ------------------------- 4.2/11.6 MB 2.5 MB/s eta 0:00:03
   --------------- ------------------------ 4.6/11.6 MB 2.7 MB/s eta 0:00:03
   ---------------- ----------------------- 4.7/11.6 MB 2.7 MB/s eta 0:00:03
   ---------------- ----------------------- 4.9/11.6 MB 2.7 MB/s eta 0:00:03
   ------------------ --------------------- 5.2/11.6 MB 2.8 MB/s eta 0:00:03
   ------------------- -------------------- 5.6/11.6 MB 2.9 MB/s eta 0:00:03
   -------------------- ------------------- 5.9/11.6 MB 3.0 MB/s eta 0:00:02
   --------------------- ------------------ 6.2/11.6 MB 3.1 MB/s eta 0:00:02
   --------------------- ------------------ 6.4/11.6 MB 3.1 MB/s eta 0:00:02
   ---------------------- ----------------- 6.6/11.6 MB 3.2 MB/s eta 0:00:02
   ----------------------- ---------------- 6.8/11.6 MB 3.2 MB/s eta 0:00:02
   ------------------------ --------------- 7.1/11.6 MB 3.3 MB/s eta 0:00:02
   ------------------------- -------------- 7.3/11.6 MB 3.3 MB/s eta 0:00:02
   -------------------------- ------------- 7.5/11.6 MB 3.3 MB/s eta 0:00:02
   -------------------------- ------------- 7.8/11.6 MB 3.4 MB/s eta 0:00:02
   --------------------------- ------------ 8.1/11.6 MB 3.4 MB/s eta 0:00:02
   ----------------------------- ---------- 8.4/11.6 MB 3.5 MB/s eta 0:00:01
   ------------------------------ --------- 8.8/11.6 MB 3.6 MB/s eta 0:00:01
   ------------------------------- -------- 9.1/11.6 MB 3.6 MB/s eta 0:00:01
   -------------------------------- ------- 9.4/11.6 MB 3.7 MB/s eta 0:00:01
   --------------------------------- ------ 9.6/11.6 MB 3.7 MB/s eta 0:00:01
   --------------------------------- ------ 9.8/11.6 MB 3.7 MB/s eta 0:00:01
   ---------------------------------- ----- 10.1/11.6 MB 3.7 MB/s eta 0:00:01
   ----------------------------------- ---- 10.3/11.6 MB 4.1 MB/s eta 0:00:01
   ------------------------------------ --- 10.6/11.6 MB 4.5 MB/s eta 0:00:01
   ------------------------------------- -- 10.9/11.6 MB 5.8 MB/s eta 0:00:01
   ---------------------------------------  11.3/11.6 MB 6.1 MB/s eta 0:00:01
   ---------------------------------------  11.6/11.6 MB 6.2 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 6.1 MB/s eta 0:00:00
Downloading numpy-1.26.4-cp311-cp311-win_amd64.whl (15.8 MB)
   ---------------------------------------- 0.0/15.8 MB ? eta -:--:--
    --------------------------------------- 0.3/15.8 MB 8.6 MB/s eta 0:00:02
   - -------------------------------------- 0.7/15.8 MB 8.9 MB/s eta 0:00:02
   -- ------------------------------------- 1.0/15.8 MB 7.9 MB/s eta 0:00:02
   --- ------------------------------------ 1.2/15.8 MB 7.0 MB/s eta 0:00:03
   --- ------------------------------------ 1.5/15.8 MB 6.6 MB/s eta 0:00:03
   ---- ----------------------------------- 1.7/15.8 MB 6.4 MB/s eta 0:00:03
   ---- ----------------------------------- 1.8/15.8 MB 6.1 MB/s eta 0:00:03
   ---- ----------------------------------- 1.9/15.8 MB 5.2 MB/s eta 0:00:03
   ---- ----------------------------------- 1.9/15.8 MB 4.7 MB/s eta 0:00:03
   ---- ----------------------------------- 2.0/15.8 MB 4.3 MB/s eta 0:00:04
   ----- ---------------------------------- 2.0/15.8 MB 4.0 MB/s eta 0:00:04
   ----- ---------------------------------- 2.1/15.8 MB 3.8 MB/s eta 0:00:04
   ----- ---------------------------------- 2.2/15.8 MB 3.7 MB/s eta 0:00:04
   ----- ---------------------------------- 2.3/15.8 MB 3.6 MB/s eta 0:00:04
   ------ --------------------------------- 2.5/15.8 MB 3.6 MB/s eta 0:00:04
   ------ --------------------------------- 2.7/15.8 MB 3.6 MB/s eta 0:00:04
   ------- -------------------------------- 2.9/15.8 MB 3.6 MB/s eta 0:00:04
   ------- -------------------------------- 3.1/15.8 MB 3.7 MB/s eta 0:00:04
   -------- ------------------------------- 3.3/15.8 MB 3.8 MB/s eta 0:00:04
   --------- ------------------------------ 3.6/15.8 MB 3.9 MB/s eta 0:00:04
   --------- ------------------------------ 3.9/15.8 MB 4.0 MB/s eta 0:00:03
   ---------- ----------------------------- 4.2/15.8 MB 4.2 MB/s eta 0:00:03
   ----------- ---------------------------- 4.6/15.8 MB 4.3 MB/s eta 0:00:03
   ------------ --------------------------- 5.0/15.8 MB 4.5 MB/s eta 0:00:03
   ------------- -------------------------- 5.4/15.8 MB 4.7 MB/s eta 0:00:03
   -------------- ------------------------- 5.9/15.8 MB 4.9 MB/s eta 0:00:03
   --------------- ------------------------ 6.3/15.8 MB 5.0 MB/s eta 0:00:02
   ---------------- ----------------------- 6.6/15.8 MB 5.1 MB/s eta 0:00:02
   ----------------- ---------------------- 7.0/15.8 MB 5.2 MB/s eta 0:00:02
   ------------------ --------------------- 7.3/15.8 MB 5.3 MB/s eta 0:00:02
   ------------------- -------------------- 7.6/15.8 MB 5.3 MB/s eta 0:00:02
   ------------------- -------------------- 7.9/15.8 MB 5.3 MB/s eta 0:00:02
   -------------------- ------------------- 8.0/15.8 MB 5.3 MB/s eta 0:00:02
   -------------------- ------------------- 8.2/15.8 MB 5.2 MB/s eta 0:00:02
   --------------------- ------------------ 8.4/15.8 MB 5.2 MB/s eta 0:00:02
   --------------------- ------------------ 8.6/15.8 MB 5.1 MB/s eta 0:00:02
   ---------------------- ----------------- 8.9/15.8 MB 5.2 MB/s eta 0:00:02
   ----------------------- ---------------- 9.1/15.8 MB 5.2 MB/s eta 0:00:02
   ----------------------- ---------------- 9.4/15.8 MB 5.2 MB/s eta 0:00:02
   ------------------------ --------------- 9.7/15.8 MB 5.2 MB/s eta 0:00:02
   ------------------------- -------------- 10.0/15.8 MB 5.2 MB/s eta 0:00:02
   -------------------------- ------------- 10.4/15.8 MB 5.3 MB/s eta 0:00:02
   --------------------------- ------------ 10.8/15.8 MB 5.3 MB/s eta 0:00:01
   --------------------------- ------------ 11.0/15.8 MB 5.3 MB/s eta 0:00:01
   ---------------------------- ----------- 11.2/15.8 MB 5.2 MB/s eta 0:00:01
   ---------------------------- ----------- 11.4/15.8 MB 5.2 MB/s eta 0:00:01
   ----------------------------- ---------- 11.7/15.8 MB 5.2 MB/s eta 0:00:01
   ------------------------------ --------- 11.9/15.8 MB 5.2 MB/s eta 0:00:01
   ------------------------------ --------- 12.1/15.8 MB 5.3 MB/s eta 0:00:01
   ------------------------------ --------- 12.2/15.8 MB 5.6 MB/s eta 0:00:01
   ------------------------------- -------- 12.4/15.8 MB 5.8 MB/s eta 0:00:01
   ------------------------------- -------- 12.6/15.8 MB 5.8 MB/s eta 0:00:01
   -------------------------------- ------- 12.9/15.8 MB 6.0 MB/s eta 0:00:01
   --------------------------------- ------ 13.1/15.8 MB 6.0 MB/s eta 0:00:01
   --------------------------------- ------ 13.2/15.8 MB 5.8 MB/s eta 0:00:01
   --------------------------------- ------ 13.4/15.8 MB 5.8 MB/s eta 0:00:01
   ---------------------------------- ----- 13.8/15.8 MB 5.9 MB/s eta 0:00:01
   ----------------------------------- ---- 14.1/15.8 MB 6.0 MB/s eta 0:00:01
   ------------------------------------ --- 14.5/15.8 MB 6.0 MB/s eta 0:00:01
   ------------------------------------- -- 14.8/15.8 MB 6.0 MB/s eta 0:00:01
   ------------------------------------- -- 14.8/15.8 MB 5.8 MB/s eta 0:00:01
   ------------------------------------- -- 14.8/15.8 MB 5.8 MB/s eta 0:00:01
   ------------------------------------- -- 14.8/15.8 MB 5.8 MB/s eta 0:00:01
   ------------------------------------- -- 14.8/15.8 MB 5.8 MB/s eta 0:00:01
   ------------------------------------- -- 14.8/15.8 MB 5.8 MB/s eta 0:00:01
   ------------------------------------- -- 14.9/15.8 MB 5.2 MB/s eta 0:00:01
   ------------------------------------- -- 14.9/15.8 MB 5.0 MB/s eta 0:00:01
   -------------------------------------- - 15.0/15.8 MB 5.0 MB/s eta 0:00:01
   -------------------------------------- - 15.1/15.8 MB 4.9 MB/s eta 0:00:01
   -------------------------------------- - 15.3/15.8 MB 4.8 MB/s eta 0:00:01
   -------------------------------------- - 15.4/15.8 MB 4.7 MB/s eta 0:00:01
   ---------------------------------------  15.5/15.8 MB 4.6 MB/s eta 0:00:01
   ---------------------------------------  15.6/15.8 MB 4.5 MB/s eta 0:00:01
   ---------------------------------------  15.7/15.8 MB 4.5 MB/s eta 0:00:01
   ---------------------------------------  15.8/15.8 MB 4.5 MB/s eta 0:00:01
   ---------------------------------------- 15.8/15.8 MB 4.4 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   --------- ------------------------------ 122.9/505.5 kB 3.5 MB/s eta 0:00:01
   ---------------------- ----------------- 286.7/505.5 kB 2.9 MB/s eta 0:00:01
   ---------------------------------- ----- 430.1/505.5 kB 3.0 MB/s eta 0:00:01
   ---------------------------------------- 505.5/505.5 kB 2.9 MB/s eta 0:00:00
Downloading tzdata-2023.4-py2.py3-none-any.whl (346 kB)
   ---------------------------------------- 0.0/346.6 kB ? eta -:--:--
   ---------------- ----------------------- 143.4/346.6 kB 2.8 MB/s eta 0:00:01
   ---------------------------------------  337.9/346.6 kB 4.2 MB/s eta 0:00:01
   ---------------------------------------- 346.6/346.6 kB 3.6 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-1.26.4 pandas-2.2.0 pytz-2024.1 tzdata-2023.4

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
altair 5.2.0 requires toolz, which is not installed.
langchain 0.1.5 requires aiohttp<4.0.0,>=3.8.3, which is not installed.
langchain 0.1.5 requires pydantic<3,>=1, which is not installed.
langchain 0.1.5 requires PyYAML>=5.3, which is not installed.
langchain 0.1.5 requires requests<3,>=2, which is not installed.
langchain 0.1.5 requires SQLAlchemy<3,>=1.4, which is not installed.
langchain 0.1.5 requires tenacity<9.0.0,>=8.1.0, which is not installed.
langchain-community 0.0.17 requires aiohttp<4.0.0,>=3.8.3, which is not installed.
langchain-community 0.0.17 requires PyYAML>=5.3, which is not installed.
langchain-community 0.0.17 requires requests<3,>=2, which is not installed.
langchain-community 0.0.17 requires SQLAlchemy<3,>=1.4, which is not installed.
langchain-community 0.0.17 requires tenacity<9.0.0,>=8.1.0, which is not installed.
streamlit 1.31.0 requires click<9,>=7.0, which is not installed.
streamlit 1.31.0 requires importlib-metadata<8,>=1.4, which is not installed.
streamlit 1.31.0 requires pillow<11,>=7.1.0, which is not installed.
streamlit 1.31.0 requires pyarrow>=7.0, which is not installed.
streamlit 1.31.0 requires requests<3,>=2.27, which is not installed.
streamlit 1.31.0 requires tenacity<9,>=8.1.0, which is not installed.
streamlit 1.31.0 requires toml<2,>=0.10.1, which is not installed.
streamlit 1.31.0 requires watchdog>=2.1.5; platform_system != "Darwin", which is not installed.

In [3]:
import pandas as pd

C:\Users\Cc\AppData\Local\Temp\ipykernel_17076\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [4]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [6]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
df1.tail()

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [10]:
df1.shape
#shape is not a method it is a attribute

(7, 3)

In [11]:
print('Number of rows',df1.shape[0])

Number of rows 7

In [13]:
print('Number of columns',df1.shape[1])

Number of columns 3

In [14]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [15]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [17]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [19]:
df1.isnull().sum(axis=1)
#give value row vise
#in axis=0 it give value in column wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [20]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [22]:
df1.describe(include=['object'])

           Name  Gender
count         7       7
unique        7       2
top     Priyang  Female
freq          1       4

In [23]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [24]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [25]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [27]:
df1['Gender'].nunique()
#no of unique values

2

In [28]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [29]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [33]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [34]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [35]:
(df1['Marks']>=90) & (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [36]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [37]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [38]:
sum(df1['Marks'].between(90,100))

4

In [39]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [42]:
print(df1['Marks'].mean())
df1['Marks'].min()

92.14285714285714

83

In [43]:
def marks(x):
    return x/2

In [44]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [45]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [46]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [48]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [49]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [50]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [51]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [55]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [56]:
#df1.drop('Male_Female',axis=1)

In [57]:
df1.drop(['Male_Female','Half_marks'],axis=1,inplace=True)

In [58]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [59]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [60]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [61]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [62]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [63]:
df1.sort_values(by=['Marks','Gender'],ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [64]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [65]:
df1[df1['Gender']=='Female']['Name']

1     Aadhya
2     Krisha
5     Mittal
6    Archana
Name: Name, dtype: object

In [67]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99